{
  "app-name": "SMSWithoutBorders",
  "menu": {
    "get-started": "Commencez",
    "home": "Accueil",
    "privacy": "Confidentialité",
    "blog": "Blog",
    "contact": "Contact",
    "login": "Connexion",
    "signup": "S'inscrire",
    "footer-blog": "SWOB Blog",
    "wallet": "Enregistrer les comptes",
    "settings": "Paramètres",
    "dashboard": "Tableau de bord",
    "sync": "Sync",
    "logout": "Déconnexion",
    "downloads": "Téléchargements",
    "developers": "Développeurs",
    "resources": "Ressources",
    "tutorials": "Tutoriels",
    "beta-testing": "Test bêta"
  },
  "labels": {
    "sync": "sync",
    "download": "Télécharger",
    "get-started": "Commencez",
    "optional": "Optionnel",
    "strong": "fort",
    "good": "bon",
    "average": "Moyenne",
    "weak": "faible",
    "very-weak": "très faible",
    "back": "Retour",
    "next": "Prochaine",
    "finish": "Terminer",
    "retry": "réessayer",
    "continue": "continuer",
    "try-again": "réessayer",
    "password-change": "changer le mot de passe",
    "tutorial": "Tutoriel",
    "learn-more": "en savoir plus",
    "help": "aide",
    "open-app": "Ouvrir l'application",
    "yes": "Oui",
    "no": "Non"
  },
  "landing": {
    "section-1": {
      "heading": "Restez connecté",
      "details": "À l'ère de la communication, restez en contact avec vos contacts sur Internet sans avoir accès à une connexion Internet active. Enregistrez l'accès à vos plateformes de communication préférées en ligne, utilisez-les hors ligne..",
      "cta-button-text": "Obtenir SWOB",
      "image-caption": "SMSwithoutBorders App"
    },
    "section-2": {
      "heading": "Comment cela fonctionne",
      "details": "Avec SMSWithoutBorders, vous pouvez envoyer des e-mails, tweeter et chatter sur Telegram sans connexion Internet active. En utilisant notre application, vous pouvez envoyer des messages en toute sécurité via un réseau de passerelles SMS pour rester connecté",
      "paragraph-1": "En configurant votre compte lorsque vous disposez d'une connexion Internet, vous pouvez continuer à communiquer par SMS lorsque vous n'avez plus accès à Internet.",
      "paragraph-2": "Nos passerelles SMS sont disponibles gratuitement. Découvrez comment configurer la vôtre ci-dessous",
      "tutorial-1": "Découvrez comment configurer votre compte et votre application",
      "tutorial-2": "Apprenez à configurer les clients de la passerelle",
      "image-caption": "Comment fonctionne SMSWithoutBorders"
    },
    "section-3": {
      "heading": "Démarrage avec SWOB",
      "details": "Avec SMSWithoutBorders, vous pouvez envoyer des e-mails, tweeter et chatter sur Telegram sans connexion Internet active. En utilisant notre application, vous pouvez envoyer des messages en toute sécurité via un réseau de passerelles SMS pour rester connecté.",
      "steps": {
        "1": {
          "heading": "S'inscrire à un compte",
          "details": "Enregistrez-vous pour un compte SMSWithoutBorders avec un numéro de téléphone valide, c'est tout. Tous les autres détails sont optionnels"
        },
        "2": {
          "heading": "Connecter les comptes",
          "details": "Reliez en toute sécurité vos comptes sur les plateformes que nous prenons en charge, comme Gmail, X et Telegram, à l'aide de la technologie OAuth2, afin que vous puissiez continuer à communiquer sur ces plateformes lorsque vous êtes hors ligne. Nous ne demandons que le strict minimum de permissions pour que nos services fonctionnent. Vous pouvez en savoir plus dans notre politique de confidentialité"
        },
        "3": {
          "heading": "Synchroniser l'application mobile",
          "details": "Synchronisez votre compte lié avec l'application mobile SMSWithoutBorders. Ce processus garantit que vous pouvez commencer à communiquer en toute sécurité par SMS. L'application générera des clés uniques pour obscurcir vos messages."
        },
        "4": {
          "heading": "Configurer les passerelles",
          "details": "SMSWithoutBorders s'appuie sur des passerelles pour assurer la communication. Nous en maintenons certaines, mais vous pouvez également créer les vôtres. En faisant cela, vous aiderez les autres utilisateurs du réseau à communiquer via votre passerelle. Les propriétaires de passerelles peuvent également utiliser leurs passerelles pour la messagerie de masse."
        }
      },
      "tutorial-1": "Découvrez comment configurer votre compte et votre application",
      "tutorial-2": "Apprenez à configurer les clients de la passerelle",
      "image-caption": "Comment fonctionne SMSWithoutBorders"
    },
    "section-4": {
      "heading": "Pourquoi utiliser SWOB ?",
      "steps": {
        "1": {
          "heading": "Accessibilité",
          "details": "L'application mobile de SWOB permet aux utilisateurs d'avoir une communication hors ligne où qu'ils soient. Il suffit de disposer d'un smartphone à message SMS pour maintenir la communication avec vos plateformes en ligne."
        },
        "2": {
          "heading": "Sécurité",
          "details": "SWOB transmet les messages dans un format crypté sécurisé. Chaque communication est ainsi protégée contre tout accès par des parties intermédiaires pendant son transit."
        },
        "3": {
          "heading": "Source ouverte",
          "details": "Chaque composant de SWOB est open sourced ! De l'application mobile aux mécanismes de routage que nous utilisons pour que vos messages SMS atteignent les plates-formes prévues."
        },
        "4": {
          "heading": "Décentralisé",
          "details": "SWOB est conçu pour fonctionner dans des modèles décentralisés. Tout le monde peut héberger un serveur SWOB. Il suffit de comprendre comment l'utiliser."
        }
      }
    }
  },

  "partners": {
    "heading": "Partenaires"
  },

  "contact": {
    "heading": "Nous contacter",
    "details": "L'utilisation de SWOB est aussi simple que l'authentification de vos informations d'identification.",
    "email": "Email",
    "website": "Site web",
    "IRC": "IRC",
    "facebook": "Facebook",
    "twitter": "X",
    "youtube": "YouTube"
  },
  "downloads": {
    "heading": "Téléchargements",
    "details": "Restez connecté grâce à nos applications mobiles et autres ressources",
    "section-1": {
      "heading": "Applications mobiles",
      "details": "Installer des applications pour Android"
    },
    "section-2": {
      "heading": "Systèmes d'exploitation",
      "details": "Images personnalisées du système d'exploitation du client de la passerelle pour raspberry pi"
    }
  },
  "beta-testing": {
    "heading": "SWOB v2 Test bêta",
    "details": "Veuillez suivre les instructions ci-dessous sur la façon de tester SMSWithoutBorders",
    "steps": {
      "1": {
        "heading": "Créer un compte",
        "details": {
          "part-1": "Créer votre compte",
          "part-2": "si vous n'en avez pas déjà un",
          "link-text": "ici"
        }
      },
      "2": {
        "heading": "Connexion à votre compte",
        "details": {
          "part-1": "Connectez-vous à votre compte afin de pouvoir ajouter des plateformes",
          "link-text": "connectez-vous ici"
        }
      },
      "3": {
        "heading": "Sauvegarder les plateformes",
        "details": {
          "part-1": "Enregistrer Gmail, X et Telegram pour que vous puissiez utiliser l'application SWOB hors ligne. Cliquez sur chaque plateforme pour voir le bouton de stockage",
          "part-2": "L'enregistrement de X sur votre téléphone peut vous obliger à double-cliquer sur le bouton d'enregistrement si l'application X est déjà installée",
          "caption": "Attention"
        }
      },
      "4": {
        "heading": "Télécharger l'application",
        "details": {
          "part-1": "Après avoir enregistré toutes les plateformes, déconnectez-vous de votre compte et rendez-vous sur le Playstore pour télécharger l'application. Cliquez sur le bouton ci-dessous pour ouvrir le Playstore",
          "part-2": "Une fois là, vous devriez voir l'écran suivant",
          "part-3": "Si vous n'avez pas le (Beta) près du nom de l'application, faites défiler vers le bas et sélectionnez rejoindre. Cela prendra un certain temps, entre 5 et 30 minutes, pour vous ajouter au programme bêta. Après cela, vous devriez être en mesure d'installer la nouvelle application. Après l'installation, ouvrez l'application et confirmez que vous avez l'écran ci-dessous pour vous assurer que vous avez la dernière version"
        }
      },
      "5": {
        "heading": "Synchroniser votre compte",
        "details": {
          "partie-1": "Dans l'application, cliquez sur le bouton Synchroniser puis continuez. Une page s'ouvrira pour vous permettre de vous connecter. Après la connexion, faites défiler vers le bas et cliquez/tapez sur le bouton de synchronisation pour accéder à la page de synchronisation.",
          "part-2": "Une fois sur la page de Synchronisation, faites défiler vers le bas et cliquez sur sync. Cela ouvrira alors la page ci-dessous.",
          "part-3": "Cliquez sur ouvrir l'application et entrez votre mot de passe pour terminer la synchronisation"
        }
      },
      "6": {
        "heading": "Passez hors ligne ! !!",
        "details": "Vous pouvez désormais utiliser SMSWithoutBorders hors ligne. Coupez votre connexion internet. Activez un forfait texte et envoyez des messages sur toutes les plateformes que vous avez enregistrées. Cela ne nous dérange pas si vous nous taggez pendant que vous y êtes :)"
      },
      "7": {
        "heading": "Nous avons besoin de votre avis !",
        "details": {
          "part-1": "Merci beaucoup d'avoir pris le temps de tester l'application. Nous apprécions votre temps et votre soutien",
          "part-2": "Veuillez répondre à ces questions",
          "link-text": "quelques questions",
          "partie-3": "sur votre expérience"
        }
      }
    }
  },
  "login": {
    "page-title": "Connexion au compte",
    "cta-button-text": "connexion",
    "forgot-password": "Mot de passe oublié",
    "account-status": "Vous n'avez pas de compte?",
    "signup-link": "S'inscrire"
  },
  "signup": {
    "page-title": "S'inscrire",
    "form": {
      "alias": {
        "label": "Alias",
        "helper-text": "Choisissez un nom pour ce compte (n'importe lequel).",
        "placeholder": "Jane Doe"
      },
      "license-terms": {
        "label": "J'ai lu la",
        "policy-link": "politique de confidentialité",
        "validation-error": "Veuillez examiner et accepter les termes et conditions pour poursuivre"
      },
      "cta-button-text": "s'inscrire"
    },
    "account-status": "Vous avez déjà un compte ?",
    "login-link": "Connexion",
    "code-verification": {
      "alerts": {
        "account-created": "votre compte a été créé, veuillez vous connecter",
        "registration-error": "Désolé, nous n'avons pas pu terminer votre inscription. Si l'erreur persiste, veuillez contacter le support",
        "app-redirect": "Veuillez cliquer sur le bouton ci-dessous pour ouvrir l'application."
      }
    }
  },
  "wallet": {
    "page-title": "Enregistrer les comptes",
    "heading": "Enregistrer les comptes",
    "details": "Une fois que vous avez enregistré vos comptes, vous pouvez commencer à utiliser l'application pour communiquer via eux comme si vous étiez connecté en ligne. Vous pouvez supprimer et enregistrer des comptes à tout moment, mais vous aurez besoin d'une connexion Internet pour le faire.",
    "instructions1": "Pour commencer, choisissez une plate-forme avec laquelle vous souhaitez communiquer hors ligne, puis cliquez sur le bouton Enregistrer.",
    "instructions2": "Vos comptes enregistrés peuvent être révoqués à tout moment. Synchronisez ce compte avec l'application pour commencer à communiquer avec eux.",
    "instructions3": "Notre liste de plates-formes prises en charge vous permet d'enregistrer pour plusieurs plates-formes. La synchronisation avec l'application est nécessaire pour communiquer hors ligne.",
    "instructions4": "Nous travaillons à l'inclusion d'autres plateformes, veuillez consulter régulièrement notre site pour obtenir une liste mise à jour des plateformes prises en charge ou consultez également notre <a href='https://afkanerd.github.io/' target='_blank' rel='noreferrer'>blog</a>.",
    "labels": {
      "description": "Description",
      "how-to-save": "Comment sauvegarder l'accès"
    },
    "info": {
      "gmail": "Sur la page d'autorisation, sélectionnez l'option d'envoi d'e-mail en votre nom",
      "twitter": "Si l'application X est déjà installée, veuillez l'ouvrir avant de cliquer sur le bouton de la boutique ci-dessous. L'application ne vous demandera l'autorisation que si elle est en cours d'exécution"
    },
    "section-1": {
      "heading": "Plateformes disponibles",
      "cta-button-text": "enregistrer"
    },
    "section-2": {
      "heading": "plates-formes enregistrées",
      "cta-button-text": "révoquer"
    },
    "revoke-dialog": {
      "heading": "Révoquer le jeton",
      "details": "Cette opération supprimera définitivement ce jeton de votre compte et ne pourra pas être annulée. Entrez votre mot de passe pour confirmer",
      "input-placeholder": "mot de passe",
      "cta-button-text": "continuer",
      "cancel-button-text": "annuler"
    },
    "prompt-dialog": {
      "heading": "Avez-vous l'application X installée ?",
      "details": "Veuillez ouvrir l'application, puis revenir à cette page et cliquer sur Continuer",
      "cta-button-text": "continuer"
    },
    "alerts": {
      "load-error": "Désolé, nous n'avons pas pu charger les plateformes. Si l'erreur persiste, veuillez contacter le support",
      "no-available-platforms": "Aucune plateforme disponible",
      "no-saved-platforms": "Aucune plateforme sauvegardée",
      "platform-deleted": "Token supprimé avec succès",
      "platform-stored": "Plateforme stockée avec succès"
    }
  },
  "telegram": {
    "phone-verification": {
      "page-title": "Accès à l'application Telegram",
      "heading": "Telegram",
      "details": "Veuillez indiquer votre numéro de téléphone pour commencer",
      "logo-alt-text": "logo du Telegram",
      "alerts": {
        "code-sent": "Un code de vérification a été envoyé à votre Telegram. Vérifiez le code dans votre application de Telegram",
        "authorization-error": "Désolé, vous n'êtes pas autorisé à faire cette demande."
      }
    },
    "code-verification": {
      "page-title": "Vérification du code du Telegram",
      "alerts": {
        "two-steps-verification-enabled": "La vérification en deux étapes est activée sur votre compte Telegram et un mot de passe est requis, veuillez entrer votre mot de passe de vérification en deux étapes Telegram"
      }
    },
    "two-steps-verification": {
      "page-title": "Vérification en deux étapes du télégramme",
      "heading": "Vérification en deux étapes du télégramme",
      "paragraph-1": "La vérification en deux étapes est activée sur votre compte Telegram. Veuillez entrer votre mot de passe de vérification en deux étapes de télégramme dans le champ fourni ci-dessous.",
      "paragraph-2": "Veuillez noter que pour votre confidentialité et votre sécurité, votre mot de passe ne sera ni lu ni stocké par SMSSans Frontières. De plus, nous vous recommandons fortement de changer régulièrement votre mot de passe pour améliorer encore la sécurité de votre compte.",
      "form": {
        "password": {
          "label": "Mot de passe de vérification en deux étapes du télégramme",
          "validation-error": "Veuillez entrer votre mot de passe de vérification en deux étapes de télégramme"
        },
        "cta-button-text": "Vérifier"
      }
    }
  },
  "code-verification": {
    "page-title": "Vérifier votre compte",
    "heading": "Vérification",
    "paragraph-1": "Un code de vérification a été envoyé sur votre téléphone (par SMS). Veuillez le saisir ci-dessous. Ce processus confirme que le numéro fourni est actif et peut être utilisé pour la communication le moment venu.",
    "paragraph-2": "Nous vous demandons également de fournir le code qui vous a été envoyé par SMS afin de garantir que vous disposez des droits (propres) nécessaires sur le numéro de téléphone requis. Cela nous aidera à empêcher les acteurs d'utiliser des numéros de téléphone non consentis pour créer des comptes - empêchant ainsi les propriétaires de continuer à le faire",
    "form": {
      "code": {
        "placeholder": "Le code de vérification"
      }
    },
    "resend-label": "Renvoyer dans",
    "resend-button-text": "code de réexpédition",
    "error-messages": {
      "otp-request": "Désolé, nous n'avons pas pu vérifier votre numéro de téléphone. Si l'erreur persiste, veuillez contacter le support",
      "otp-validation": "Désolé, nous n'avons pas pu vérifier votre code. Si l'erreur persiste, veuillez contacter le support"
    }
  },
  "sync": {
    "page-title": "Synchroniser votre compte",
    "heading": "Synchroniser les comptes",
    "section-1": {
      "details": "Veuillez cliquer sur le lien ci-dessous pour enregistrer les jetons",
      "summary": {
        "caption": "en savoir plus",
        "details": "La synchronisation devient disponible uniquement après avoir effectué une action qui met à jour vos configurations de sécurité. Un exemple est la sauvegarde de l'accès dans le portefeuille."
      },
      "cta-button-text": "Enregistrer l'accès maintenant"
    },
    "section-2": {
      "paragraph-1": "Cela vous permet d'utiliser la passerelle sécurisée SW/OB pour tous les messages.",
      "paragraph-2": "La synchronisation devient disponible uniquement après avoir effectué une action qui met à jour vos configurations de sécurité. Un exemple est la sauvegarde de l'accès dans le portefeuille.",
      "status": {
        "heading": "Statut",
        "connected": "connecté",
        "disconnected": "déconnecté",
        "complete": "complet",
        "scanned": "scanné",
        "loading": "chargement"
      },
      "cta-button-text": "sync"
    },
    "alerts": {
      "sync-started": "Sync commencée",
      "sync-complete": "Sync terminée",
      "sync-scanned": "Code scanné avec succès",
      "no-platforms": "Désolé, il semble que vous n'ayez enregistré aucun jeton.",
      "sync-error": "Désolé, une erreur s'est produite pendant la synchronisation, veuillez réessayer.",
      "sync-closed": "La session de synchronisation est fermée. Veuillez cliquer sur le bouton de synchronisation pour recommencer",
      "click-button": "Veuillez cliquer sur le bouton ci-dessous pour ouvrir l'application.",
      "scan-code": "Veuillez scanner le code ci-dessous avec l'application mobile"
    }
  },
  "dashboard": {
    "page-title": "Tableau de bord",
    "greeting-1": "Bonjour!",
    "greeting-2": "Bienvenue",
    "join-date": "Date d'adhésion",
    "last-login": "Dernière connexion",
    "start": " Suivez ces étapes simples pour commencer :",
    "label1": "Créer un compte",
    "label2": "Plates-formes de liens",
    "label3": "Télécharger l'application",
    "label4": "Synchroniser",
    "description2": "Connectez vos comptes sur les plates-formes prises en charge de manière sécurisée à l'aide de la technologie OAuth2. Cela vous permet de rester en contact avec d'autres personnes sur ces plates-formes même lorsque vous n'êtes pas en ligne. Sur la page 'Enregistrer les comptes', sélectionnez la plate-forme souhaitée et cliquez sur Enregistrer.",
    "description3": "L'application est la seule plate-forme à travers laquelle vous pouvez accéder aux fonctionnalités et fonctions du SWOB, elle est conçue pour offrir une expérience utilisateur transparente.",
    "description4": "Synchronisez enfin avec votre application mobile en cliquant sur le bouton de synchronisation et commencez à communiquer",
    "continue": "continuer",
    "back": "dos",
    "reset": "réinitialiser",
    "finish": "Finir",
    "completed": "Toutes nos félicitations! Vous avez configuré avec succès votre compte SWOB 🎉",
    "alerts": {
      "load-error": "Désolé, nous n'avons pas pu localiser vos métriques. Si l'erreur persiste, veuillez contacter le support",
      "idle": {
        "heading": "Vous êtes toujours là ?",
        "details": "Vous serez bientôt déconnecté pour des raisons de sécurité"
      }
    }
  },
  "settings": {
    "page-title": "Paramètres",
    "heading": "Paramètres",
    "details": "Gérer votre compte",
    "paragraph": "Veuillez sélectionner un paramètre dans le menu",
    "menu": {
      "password-change": "Changement de mot de passe",
      "account-deletion": "Supprimer le compte"
    }
  },
  "password-change": {
    "page-title": "Changement de mot de passe",
    "heading": "Changement du mot de passe",
    "details": "Définir un nouveau mot de passe pour votre compte",
    "alerts": {
      "warning": "Cette action supprimera tous les jetons actuellement enregistrés dans votre portefeuille et vous serez déconnecté."
    }
  },
  "account-deletion": {
    "page-title": "Suppression du compte",
    "heading": "Supprimer le compte",
    "details": "Définissez un nouveau mot de passe pour votre compte",
    "confirmation": {
      "text": "Je confirme",
      "validation-error": "Veuillez entrer {{confirmation}} et votre mot de passe pour continuer"
    },
    "paragraph": {
      "part-1": "Veuillez entrer",
      "part-2": "et votre mot de passe pour procéder"
    },
    "form": {
      "confirmation": {
        "label": "Confirmation",
        "placeholder": "entrer la confirmation",
        "helper-text": "Entrez"
      }
    },
    "alerts": {
      "warning": "Cette action supprimera tous les jetons actuellement enregistrés dans votre portefeuille et vous serez déconnecté.",
      "account-deleted": "Votre compte a été supprimé. Nous sommes tristes de vous voir partir",
      "invalid-password": "Interdit, le mot de passe n'est pas valide"
    }
  },
  "password-recovery": {
    "verification": {
      "page-title": "Récupérer votre mot de passe",
      "heading": "Récupération du mot de passe",
      "details": "Veuillez indiquer votre numéro de téléphone pour commencer"
    },
    "recovery": {
      "page-title": "Récupération du mot de passe",
      "heading": "Récupération du mot de passe",
      "details": "Définir un nouveau mot de passe pour votre compte"
    },
    "alert-messages": {
      "account-verified": "Compte vérifié"
    }
  },
  "404-page": {
    "page-tite": "404, page non disponible",
    "error-message": "Désolé, cette page n'est pas disponible pour le moment"
  },
  "alert-messages": {
    "close": "Veuillez fermer cette fenêtre et revenir en arrière",
    "redirect": "Vous allez être redirigé sous peu",
    "loading": "traitement, veuillez patienter",
    "alert-placeholder": "Message d'alerte ici",
    "code-verified": "Code vérifié avec succès",
    "request-received": "Succès votre demande a été reçue",
    "phone-number-verified": "Numéro de téléphone vérifié avec succès",
    "password-changed": "Le mot de passe a été changé avec succès",
    "login-successful": "Connexion réussie",
    "logout-successful": "Déconnexion réussie",
    "missing-permission": "Oups ! Vous avez manqué quelque chose",
    "coming-soon": "A venir prochainement ...",
    "recaptcha": {
      "loading": "chargement du reCAPTCHA, veuillez patienter",
      "disabled": "reCAPTCHA a été désactivé, vous pouvez le réactiver dans la configuration de votre projet.",
      "load-error": "Le chargement du reCAPTCHA a échoué. Veuillez vous assurer que vous disposez d'une connexion réseau active",
      "connect-error": "La connexion au reCAPTCHA a échoué. Veuillez vérifier votre réseau et recharger cette page"
    }
  },
  "error-messages": {
    "general-error-title": "Une erreur s'est produite",
    "general-error-message": "Désolé, une erreur s'est produite, veuillez réessayer",
    "network-error": "Une erreur s'est produite, veuillez vérifier votre réseau et réessayer",
    "invalid-code": "Le code fourni est invalide, veuillez réessayer",
    "invalid-number": "Le numéro fourni est invalide",
    "invalid-password": "Mot de passe invalide fourni",
    "invalid-login": "Interdit, le compte n'est pas autorisé. Vérifiez votre numéro de téléphone et votre mot de passe",
    "400": "Quelque chose n'a pas fonctionné. Nous travaillons à résoudre ce problème. Veuillez réessayer",
    "401": "Désolé, vous n'êtes pas autorisé à effectuer cette action",
    "403": "Interdit. Désolé, votre session a peut-être expiré. Veuillez vous déconnecter et vous reconnecter ou recharger cette page.",
    "404": "Désolé, la ressource que vous avez demandée est indisponible ou non accessible.",
    "409": "Il y a une possibilité de duplication de ce compte, veuillez contacter le support.",
    "422": "Désolé, nous n'avons pas reçu les autorisations dont nous avons besoin pour envoyer des e-mails en votre nom. Pas d'inquiétude, veuillez sélectionner l'option dans l'écran d'autorisation lorsque vous y êtes invité.",
    "429": "Trop de tentatives échouées, veuillez attendre un peu et réessayer.",
    "500": "Une erreur critique s'est produite. Veuillez contacter le support"
  },
  "forms": {
    "phone-number": {
      "label": "Numéro de téléphoner",
      "placeholder": "Entrez votre numéro de téléphone",
      "helper-text": "Nous enverrons un SMS unique à ce numéro pour confirmation",
      "validation-errors": {
        "required": "veuillez entrer un numéro de téléphone",
        "invalid": "veuillez fournir un numéro de téléphone valide"
      }
    },
    "password": {
      "label": "Mot de passe",
      "labels": {
        "current": "Mot de passe actuel",
        "new": "Nouveau mot de passe"
      },
      "placeholder": "mot de passe",
      "validation-errors": {
        "min": "Le mot de passe doit comporter au moins 8 caractères",
        "required": "Mot de passe requis",
        "required-new": "Veuillez saisir un nouveau mot de passe",
        "lowercase-letters": "Le mot de passe doit comporter au moins une lettre minuscule",
        "uppercase-letters": "Le mot de passe doit comporter au moins une lettre majuscule",
        "numbers": "Le mot de passe doit inclure au moins un numéro",
        "special-characters": "Le mot de passe doit contenir au moins un des caractères spéciaux suivants : !@#$%^&*()_+-=",
        "no-compromised-password": "Le mot de passe a déjà été compromis lors d'une violation de données. Utilisez un autre mot de passe"
      }
    },
    "confirm-password": {
      "label": "Confirmer le mot de passe",
      "placeholder": "Retaper le mot de passe",
      "validation-errors": {
        "min": "Le mot de passe doit comporter au moins 8 caractères",
        "required": "Veuillez confirmer votre mot de passe",
        "match": "les mots de passe ne correspondent pas"
      }
    },
    "terms": {
      "validation-errors": {
        "required": "Veuillez lire et accepter les conditions"
      }
    },
    "recaptcha": {
      "validation-error": "Veuillez prouver que vous n'êtes pas un robot en résolvant le reCAPTCHA."
    }
  },
  "tutorials": {
    "onboarding": {
      "steps": {
        "1": {
          "title": "Bienvenue",
          "heading": "Apprendre à enregistrer des comptes",
          "details": "Ce tutoriel vous aidera à démarrer"
        },
        "2": {
          "title": "Plates-formes disponibles",
          "details": "Enregistrer l'accès aux plateformes disponibles en cliquant sur le bouton Enregistrer sous chaque plateforme."
        },
        "3": {
          "title": "Synchronisation",
          "details": "Synchronisez-vous avec l'application mobile pour commencer à communiquer en toute sécurité."
        },
        "4": {
          "title": "Obtenir de l'aide",
          "details": "Vous pouvez revoir ce tutoriel en cliquant ici."
        }
      }
    },
    "sync": {
      "steps": {
        "1": {
          "title": "Tutoriel",
          "heading": "Apprenez à synchroniser avec l'application",
          "details": "Ce tutoriel vous aidera à démarrer"
        },
        "2": {
          "title": "Commencez",
          "details": "Cliquez sur le bouton de synchronisation pour commencer le processus"
        },
        "3": {
          "title": "Scanner le code QR",
          "details": "Utilisez le scanner de l'application pour scanner le code QR généré."
        },
        "3-alt": {
          "title": "Ouvrir l'application",
          "details": "cliquez sur le bouton pour ouvrir l'application"
        },
        "4": {
          "title": "Entrez le mot de passe",
          "details": "Entrez votre mot de passe sur l'écran de l'application pour terminer la synchronisation"
        },
        "5": {
          "title": "Obtenir de l'aide",
          "details": "Vous pouvez revoir ce tutoriel en cliquant ici"
        }
      }
    }
  }
}
