{
  "app-name": "SMSWithoutBorders",
  "menu": {
    "get-started": "Get Started",
    "home": "Home",
    "privacy": "Privacy",
    "blog": "Blog",
    "contact": "Contact Us",
    "login": "Log In",
    "signup": "Sign Up",
    "footer-blog": "SWOB Blog",
    "wallet": "Save Accounts",
    "settings": "Settings",
    "dashboard": "Dashboard",
    "sync": "Sync",
    "logout": "Logout",
    "downloads": "Downloads",
    "developers": "Developers",
    "resources": "Resources",
    "tutorials": "Tutorials",
    "beta-testing": "Beta Testing"
  },
  "labels": {
    "sync": "sync",
    "download": "Download",
    "get-started": "Get Started",
    "optional": "optional",
    "strong": "strong",
    "good": "good",
    "average": "average",
    "weak": "weak",
    "very-weak": "very weak",
    "back": "Back",
    "next": "Next",
    "finish": "Finish",
    "retry": "retry",
    "continue": "continue",
    "try-again": "try again",
    "password-change": "change password",
    "tutorial": "Tutorial",
    "learn-more": "learn more",
    "help": "help",
    "open-app": "Open App",
    "yes": "Yes",
    "no": "No"
  },
  "landing": {
    "section-1": {
      "heading": "Stay Connected",
      "details": "In this age of communication, keep in touch with your contacts across the internet without access to an active internet connection. Save access to your favourite communications platforms while online, use them while offline.",
      "cta-button-text": "Get SWOB",
      "image-caption": "SMSwithoutBorders App"
    },
    "section-2": {
      "heading": "How it works",
      "details": "With SMSWithoutBorders, you can send emails, tweet and chat on telegram without an active internet connection. By using our andriod app, you can send messages securely through a network of SMS gateways to stay connected",
      "paragraph-1": "By setting up your account while you have an internet connection, you can continue to communicate later using SMS when your no longer have internet access",
      "paragraph-2": "Our SMS gateways are freely available. Learn how to set up yours below",
      "tutorial-1": "Learn how to setup your account and app",
      "tutorial-2": "Learn how to setup gateway clients",
      "image-caption": "How SMSWithoutBorders works"
    },
    "section-3": {
      "heading": "Getting Started with SWOB",
      "details": "With SMSWithoutBorders, you can send emails, tweet and chat on Telegram without an active internet connection. By using our andriod app, you can send messages securely through a network of SMS gateways to stay connected",
      "steps": {
        "1": {
          "heading": "Signup for an account",
          "details": "Register for an SMSWithoutBorders account with a valid phone number, thats it. All other details are optional"
        },
        "2": {
          "heading": "Connect Accounts",
          "details": "Securely Link your accounts on platforms we support like Gmail, X and telegram using OAuth2 technology so that you can continue to communicate on them when offline. We only request the bare minimum permissions for our services to work. You can learn more in our privacy policy"
        },
        "3": {
          "heading": "Synchronize Mobile App",
          "details": "Synchronize your linked account with the SMSWithoutBorders mobile app. This process ensures your can communicate begin securely over SMS. The app will generate unique keys for obfuscating your messages."
        },
        "4": {
          "heading": "Setup Gateways",
          "details": "SMSWithoutBorders relies on gateways to ensure communication. We maintain some but you can also setup your own. By doing so, you will be helping other users on the network communicate through your gateway. Gateway owners can also use their gateways for bulk messaging."
        }
      },
      "tutorial-1": "Learn how to setup your your account and app",
      "tutorial-2": "Learn how to setup gateway clients",
      "image-caption": "How SMSWithoutBorders works"
    },
    "section-4": {
      "heading": "Why use SWOB?",
      "steps": {
        "1": {
          "heading": "Accessibility",
          "details": "SWOB’s mobile app allows users to have offline communication wherever they are. With as simple as having an SMS message smartphone you can maintain communications with your online platforms"
        },
        "2": {
          "heading": "Security",
          "details": "SWOB transmits messages in securely encrypted formats. This secures every communication from being accessed by intermediate parties while in transit."
        },
        "3": {
          "heading": "Open source",
          "details": "Every component of SWOB is open sourced! From the mobile app to the routing mechanisms we use to get your SMS messages to reach your intended platforms"
        },
        "4": {
          "heading": "Decentralized",
          "details": "SWOB is built to work in decentralized models. Anyone can host a SWOB server. It’s as easy as understanding how to use it"
        }
      }
    }
  },

  "partners": {
    "heading": "Partners"
  },

  "contact": {
    "heading": "Contact Us",
    "details": "Using SWOB is as easy as authenticating your credentials",
    "email": "Email",
    "website": "Website",
    "IRC": "IRC",
    "facebook": "Facebook",
    "twitter": "X",
    "youtube": "YouTube"
  },
  "downloads": {
    "heading": "Downloads",
    "details": "Stay Connected with our mobile apps and other resources",
    "section-1": {
      "heading": "Mobile Apps",
      "details": "Install applications for Android"
    },
    "section-2": {
      "heading": "Operating Systems",
      "details": "Custom gateway client OS images for raspberry pi"
    }
  },
  "beta-testing": {
    "heading": "SWOB v2 Beta testing",
    "details": "Please follow the instructions below on how to test SMSWithoutBorders",
    "steps": {
      "1": {
        "heading": "Create an account",
        "details": {
          "part-1": "Create your account",
          "part-2": "if you don't have one already",
          "link-text": "here"
        }
      },
      "2": {
        "heading": "Login to your account",
        "details": {
          "part-1": "Login to your account so that you can add platforms",
          "link-text": "login here "
        }
      },
      "3": {
        "heading": "Save platforms",
        "details": {
          "part-1": "Save Gmail, X and telegram so that you can use the SWOB app offline. Click on each platform to see the save button",
          "part-2": "Saving X on your phone may require you to click the save button twice if you have the X app already installed",
          "caption": "Note"
        }
      },
      "4": {
        "heading": "Download app",
        "details": {
          "part-1": "After saving all the platforms, logout from your account and head over to the playstore to download the app. Click on the button bellow to open playstore",
          "part-2": "Once there you should see the following screen",
          "part-3": "If you do not have the (Beta) near the app name, scroll down and select join. This will take some time about 5mins to 30mins to add you to the beta program. After that, you should be able to install the new app. After installing, open the app and confirm you have the screen below to make sure you have the latest version"
        }
      },
      "5": {
        "heading": "Synchronize your account",
        "details": {
          "part-1": "In the app click on the Synchronize button then continue. This will open a page for you to login. After login, scroll down and click/tap on the sync button to access the Synchronization page.",
          "part-2": "Once on the Synchronization page, scroll down and click sync. This will then open the page below.",
          "part-3": "Click on open app and enter your password to finish Synchronization."
        }
      },
      "6": {
        "heading": "Go offline!!!",
        "details": "You can now use SMSWithoutBorders offline. turn off your internet connection. Activate a text bundle and send messages on all the platforms you have saved. We don't mind if you tag us while you're at it :)"
      },
      "7": {
        "heading": "We need your feedback!",
        "details": {
          "part-1": "Thank you so much for taking the time to test the app. We appreciate your time and support",
          "part-2": "Please answer these",
          "link-text": "few questions",
          "part-3": "about your experience"
        }
      }
    }
  },
  "login": {
    "page-title": "Account Login",
    "cta-button-text": "login",
    "forgot-password": "Forgot Password",
    "account-status": "Don't have an account?",
    "signup-link": "Sign Up"
  },
  "signup": {
    "page-title": "Sign Up",
    "form": {
      "alias": {
        "label": "Alias",
        "helper-text": "Choose a name for this account (could be anything)",
        "placeholder": "Jane Doe"
      },
      "license-terms": {
        "label": "I have read the",
        "policy-link": "privacy policy",
        "validation-error": "Please review and accept terms and conditions to proceed"
      },
      "cta-button-text": "sign up"
    },
    "account-status": "Already have an account?",
    "login-link": "Sign In",
    "code-verification": {
      "alerts": {
        "account-created": "your account has been created, please login",
        "registration-error": "Sorry we could not complete your registration. If error persists, please contact support",
        "app-redirect": "Please click on the button below to open the app"
      }
    }
  },
  "wallet": {
    "page-title": "Save Accounts",
    "heading": "Save Accounts",
    "details": "Once you save your accounts, you can begin using the app to communicate through them as if you are connected online. You can delete and save accounts at any time, however you will need to have an internet connection to do so.",
    "instructions1": "To get started, Pick a platform you want to communicate with offline, and click the save button.",
    "instructions2": "Your saved accounts can be revoked anytime. Sync this account with the app to start communicating with them.",
    "instructions3": "Our supported platforms list allows you to save for multiple platforms. Syncing with the app is required to communicate offline.",
    "instructions4": "We are working on including more platforms, please check regularly for the updated list of supported platforms or also check out our <a href='https://afkanerd.github.io/' target='_blank' rel='noreferrer'>blog</a>",
    "labels": {
      "description": "Description",
      "how-to-save": "How to save access"
    },
    "info": {
      "gmail": "On the authorization page, select the option to send email on your behalf",
      "twitter": "If you already have the X app installed, please open it before clicking on the save button below. The app will only prompt you for authorization if it is running"
    },
    "section-1": {
      "heading": "Available Platforms",
      "cta-button-text": "save"
    },
    "section-2": {
      "heading": "Saved Platforms",
      "cta-button-text": "revoke"
    },
    "revoke-dialog": {
      "heading": "Revoke token",
      "details": "This will permanently remove this token from your account and cannot be reversed. Enter your password to Confirm",
      "input-placeholder": "password",
      "cta-button-text": "continue",
      "cancel-button-text": "cancel"
    },
    "prompt-dialog": {
      "heading": "Do you have the X app installed ?",
      "details": "Please open the app then return to this page and click continue",
      "cta-button-text": "continue"
    },
    "alerts": {
      "load-error": "Sorry we could not load platforms. If error persists, please contact support",
      "no-available-platforms": "No available platforms",
      "no-saved-platforms": "No saved platforms",
      "platform-deleted": "Token deleted successfully",
      "platform-stored": "Platform saved successfully"
    }
  },
  "telegram": {
    "phone-verification": {
      "page-title": "Save Telegram Access",
      "heading": "Telegram",
      "details": "Please fill in your phone number to begin",
      "logo-alt-text": "telegram logo",
      "alerts": {
        "code-sent": "A verification code has been sent to your Telegram. Check code in your Telegram app",
        "authorization-error": "Sorry, you are not authorized to make this request"
      }
    },
    "code-verification": {
      "page-title": "Telegram Code Verification",
      "alerts": {
        "two-steps-verification-enabled": "Two-steps verification is enabled on your Telegram account and a password is required, please enter your Telegram two-steps verification password"
      }
    },
    "two-steps-verification": {
      "page-title": "Telegram Two-Steps Verification",
      "heading": "Telegram Two-Steps Verification",
      "paragraph-1": "Two-steps verification is enabled on your Telegram account. Please enter your Telegram two-Steps verification password in the field provided below.",
      "paragraph-2": "Please note that for your privacy and security, your password will not be read or stored by SMSWithoutBorders. Additionally, we highly recommend that you change your password regularly to further enhance the security of your account.",
      "form": {
        "password": {
          "label": "Telegram Two-Steps Verification Password",
          "validation-error": "Please enter your Telegram two-Steps verification password"
        },
        "cta-button-text": "Verify"
      }
    }
  },
  "code-verification": {
    "page-title": "Verify your account",
    "heading": "Verification",
    "paragraph-1": "A verification code has been sent to your Telegram app. Please enter it below. This process confirms the number provided is active and can be used for communication when the time comes.",
    "paragraph-2": "We also require you to provide the code sent to you by SMS as a means of guaranteeing you have the necessary (own) rights to the required phone number. This will help us prevent actors from using non consented phone numbers to create accounts - preventing the owners from further doing so",
    "form": {
      "code": {
        "placeholder": "Verification Code"
      }
    },
    "resend-label": "Resend in",
    "resend-button-text": "resend code",
    "error-messages": {
      "otp-request": "Sorry we could not verify your phone number. If error persists, please contact support",
      "otp-validation": "Sorry we could not verify your code. If error persists, please contact support"
    }
  },
  "sync": {
    "page-title": "Synchronize your account",
    "heading": "Synchronize Accounts",
    "section-1": {
      "details": "Please click on the link below to save tokens",
      "summary": {
        "caption": "learn more",
        "details": "Synchronization becomes available only after you perform an action that updates your security configurations. An example is saving access in the wallet."
      },
      "cta-button-text": "Save Access Now"
    },
    "section-2": {
      "paragraph-1": "This lets you use the SW/OB secure gateway for all messages",
      "paragraph-2": "Click the sync button to connect your app with this account. This will update your app with the saved accounts which can then be used offline without an internet connection. This process requires an internet connection and is necessary each time you save another account.",
      "status": {
        "heading": "Status",
        "connected": "connected",
        "disconnected": "disconnected",
        "complete": "complete",
        "scanned": "scanned",
        "loading": "loading"
      },
      "cta-button-text": "sync"
    },
    "alerts": {
      "sync-started": "Sync started",
      "sync-complete": "Sync Complete",
      "sync-scanned": "Code Scanned successfully",
      "no-platforms": "Sorry it seems you havent saved any tokens",
      "sync-error": "Sorry an error occured while synchronizing, Please try again",
      "sync-closed": "Sync session closed. please click the sync button to start again",
      "click-button": "Please click on the button below to open the app",
      "scan-code": "Please scan the code below with the mobile app"
    }
  },
  "dashboard": {
    "page-title": "Dashboard",
    "greeting-1": "Hello!",
    "greeting-2": "Welcome",
    "join-date": "Join Date",
    "last-login": "Last Login",
    "start": "Let us help you get started with setting up your SMSWithoutBorders account.",
    "label1": "Create an account",
    "label2": "Save Platforms",
    "label3": "Download App",
    "label4": "Sync",
    "description1": "Sign up celebration :)",
    "description2": "In this step we will save your online accounts, which can be used with the SWOB app offline. You can save as many accounts as you may need to use without an internet connection.",
    "description3": " The app allows you send out messages through your saved platforms using SMS messaging on your mobile device. The app encrypts your messages making them secure while transmitting through SMS. In this step we will download the app on your preferred android device.",
    "description4": "Finally, to begin using the app you need to connect it to this account. We will help you through a simple automated process once you click the synchronization button.",
    "continue": "continue",
    "back": "back",
    "reset": "reset",
    "finish": "Finish",
    "completed": "Congratulations! You have successfully set up your SWOB account 🎉Please note you will need an internet connection each time you add a new account, so that you can connect it to the app",
    "alerts": {
      "load-error": "Sorry we could not locate your metrics. If error persists, please contact support",
      "idle": {
        "heading": "Are you still there ?",
        "details": "You will be logged out soon for security reasons"
      }
    }
  },
  "settings": {
    "page-title": "Settings",
    "heading": "Settings",
    "details": "Manage your account",
    "paragraph": "Please select a setting from the menu",
    "menu": {
      "password-change": "Password Change",
      "account-deletion": "Delete Account"
    }
  },
  "password-change": {
    "page-title": "Password Change",
    "heading": "Password Change",
    "details": "Set a new password for your account",
    "alerts": {
      "warning": "This action will delete all currently saved tokens in your wallet and you will be logged out"
    }
  },
  "account-deletion": {
    "page-title": "Account Deletion",
    "heading": "Delete Account",
    "details": "Set a new password for your account",
    "confirmation": {
      "text": "IConfirmThisAction",
      "validation-error": "Please enter {{confirmation}} and your password to proceed"
    },
    "paragraph": {
      "part-1": "Please enter",
      "part-2": "and your password to proceed"
    },
    "form": {
      "confirmation": {
        "label": "Confirmation",
        "placeholder": "enter confirmation",
        "helper-text": "Enter"
      }
    },
    "alerts": {
      "warning": "This action will delete all currently saved tokens in your wallet and you will be logged out",
      "account-deleted": "Your account has been deleted. We are sad to see you go",
      "invalid-password": "Forbidden, password is invalid"
    }
  },
  "password-recovery": {
    "verification": {
      "page-title": "Recover your password",
      "heading": "Password Recovery",
      "details": "Please fill in your phone number to begin"
    },
    "recovery": {
      "page-title": "Password Recovery",
      "heading": "Password Recovery",
      "details": "Set a new password for your account"
    },
    "alert-messages": {
      "account-verified": "Account verified"
    }
  },
  "404-page": {
    "page-tite": "404, page unavailable",
    "error-message": "Sorry, this page is unavailable at the moment"
  },
  "alert-messages": {
    "close": "Please close this window and go back",
    "redirect": "You will be redirected shortly",
    "loading": "processing please wait",
    "alert-placeholder": "Alert message here",
    "code-verified": "Code Verified Successfully",
    "request-received": "Success your request has been received",
    "phone-number-verified": "Phone number verified successully",
    "password-changed": "Password changed successfully",
    "login-successful": "Login successful",
    "logout-successful": "Logout successful",
    "missing-permission": "Whoops! you missed something",
    "coming-soon": "Coming soon ...",
    "recaptcha": {
      "loading": "loading reCAPTCHA  please wait",
      "disabled": "reCAPTCHA has been disabled, you can re-enable it in your project's configuration",
      "load-error": "reCAPTCHA failed to load. Please make sure you have an active network connection",
      "connect-error": "reCAPTCHA failed to connect. Please check your network and reload this page"
    }
  },
  "error-messages": {
    "general-error-title": "An error occured",
    "general-error-message": "Sorry, an error occured please try again",
    "network-error": "An error occured, please check your network and try again",
    "invalid-code": "Invalid code provided, please try again",
    "invalid-number": "Invalid number provided",
    "invalid-password": "Invalid password provided",
    "invalid-login": "Forbidden, account is unauthorized. \n check your phonenumber and password",
    "400": "Something went wrong \n We are working to resolve this. Please try again",
    "401": "Sorry you are not authorized to perform this action",
    "403": "Forbidden. Sorry your session may have expired. Please logout and login again or reload this page",
    "404": "Sorry the resource you requested is unavailable or not accessible",
    "409": "There is a possible duplicate of this account please contact support",
    "422": "Sorry, we did not receive the permissions we need to send email on your behalf. No worries, please select the option from the authorization screen when prompted",
    "429": "Too many failed attempts please wait a while and try again",
    "500": "A critical error occured. Please contact support"
  },
  "forms": {
    "phone-number": {
      "label": "Phone Number",
      "placeholder": "Enter your phone number",
      "helper-text": "We will send a one time SMS to this number for confirmation",
      "validation-errors": {
        "required": "please enter a phone number",
        "invalid": "please provide a valid phone number"
      }
    },
    "password": {
      "label": "Password",
      "labels": {
        "current": "Current Password",
        "new": "New Password"
      },
      "placeholder": "password",
      "validation-errors": {
        "min": "Password must be at least 8 characters long",
        "required": "Password is required",
        "required-new": "Please enter new password",
        "lowercase-letters": "Password must include at least one lowercase letter",
        "uppercase-letters": "Password must include at least one uppercase letter",
        "numbers": "Password must include at least one number",
        "special-characters": "Password must include at least one of the following special characters: !@#$%^&*()_+-=",
        "no-compromised-password": "Password has previously been compromised in a data breach. Use another password"
      }
    },
    "confirm-password": {
      "label": "Confirm Password",
      "placeholder": "retype password",
      "validation-errors": {
        "min": "Password must be at least 8 characters long",
        "required": "Please confirm your password",
        "match": "passwords do not match"
      }
    },
    "terms": {
      "validation-errors": {
        "required": "Please review and accept terms"
      }
    },
    "recaptcha": {
      "validation-error": "Please prove you are not a robot by solving reCAPTCHA"
    }
  },
  "tutorials": {
    "onboarding": {
      "steps": {
        "1": {
          "title": "Welcome",
          "heading": "Learn how to save accounts",
          "details": "This tutorial will help you get started"
        },
        "2": {
          "title": "Available platforms",
          "details": "Save access for available platforms by clicking on the save button under each platform"
        },
        "3": {
          "title": "Synchronization",
          "details": "Synchronize with the mobile app to start communicating securely"
        },
        "4": {
          "title": "Get Help",
          "details": "You can view this tutorial again by clicking here"
        }
      }
    },
    "sync": {
      "steps": {
        "1": {
          "title": "Tutorial",
          "heading": "Learn how to Synchronize with app",
          "details": "This tutorial will help you get started"
        },
        "2": {
          "title": "Get started",
          "details": "Click the sync button to begin the process"
        },
        "3": {
          "title": "Scan QR code",
          "details": "Use the app scanner to scan the generated QR code"
        },
        "3-alt": {
          "title": "Open App",
          "details": "click on the button to open the app"
        },
        "4": {
          "title": "Enter password",
          "details": "Enter your password on the app screen to complete synchronization"
        },
        "5": {
          "title": "Get Help",
          "details": "You can view this tutorial again by clicking here"
        }
      }
    }
  }
}
